<?php

// Функция проверяет, является ли год високосным
function isLeapYear($year) {
    return (($year % 4 == 0) && ($year % 100 != 0)) || ($year % 400 == 0);
}

function is_date($str) {
    // Регулярное выражение для проверки форматов даты
    // $dateRegex = '/^(0[1-9]|[12][0-9]|3[01])[.\/-](0[1-9]|1[0-2])[.\/-](\d{1,4})$/';
    // $dayWithMonthRegex = '/^(\d{1,2})\s*(январ[яь]|феврал[яь]|март[а]*|апрел[яь]|ма[йя]|июн[яь]|июл[яь]|август[а]*|сентябр[яь]|октябр[яь]|ноябр[яь]|декабр[яь])/u';

    // Проверка на високосность года
    if (preg_match('/^(29)[.\/-](02)[.\/-](\d{1,4})$/', $str, $matches)) {
        $year = $matches[3];
        return isLeapYear($year);
    }

    $dateRegex = '/^(0[1-9]|[12][0-9]|3[01])[.\/-](0[13578]|1[02])[.\/-](\d{1,4})$|^(0[1-9]|[12][0-9]|30)[.\/-](0[469]|11)[.\/-](\d{1,4})$|^(0[1-9]|[12][0-9])[.\/-](02)[.\/-](\d{1,4})$/';

    $dayWithMonthRegex = '/^([1-9]|[12][0-9]|3[01])\s*(январ[яь]|март[а]*|ма[йя]|июл[яь]|август[а]*|октябр[яь]|декабр[яь])|^([1-9]|[12][0-9]|30)\s*(апрел[яь]|июн[яь]|сентябр[яь]|ноябр[яь])|^([1-9]|[12][0-9])\s*(феврал[яь])/u';
   
    // Проверка соответствия строки форматам даты
    return preg_match($dateRegex, $str) || preg_match($dayWithMonthRegex, $str);
}

?>